Revit 2027 API
PipeSettings.SizePrefix Property
 The size prefix string.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string SizePrefix { get; set; }
Public Property SizePrefix As String
	Get
	Set
public:
property String^ SizePrefix {
	String^ get ();
	void set (String^ value);
}
member SizePrefix : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace